Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/mem/r_sdc_sdmem_initialize.c
/**********************************************************************************************************************
* Copyright (c) 2014 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
**********************************************************************************************************************/
/**********************************************************************************************************************
* System Name  : SDHI Driver
* File Name    : r_sdc_sdmem_initialize.c
* Version      : 3.01
* Device       : RX
* Abstract     : API & Sub module
* Tool-Chain   : For RX e2_studio
* OS           : not use
* H/W Platform : RSK board for RX
* Description  : Interface file for SDC SD API for RX
* Limitation   : None
**********************************************************************************************************************/
/**********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              : 05.09.2014 1.00    First Release
*              : 17.07.2015 1.10    Standardized by the combo.
*              : 31.07.2017 2.00    SDHI FIT module separated into hardware low level layer and middleware layer.
*              :                    Changed prefix from SDHI to SDC_SD.
*              : 29.06.2018 2.02    Corresponded to SD Specifications Part1 Physical Layer Simplified Specification.
*              : 10.02.2020 3.00    Supported GCC and IAR compiler.
*              :                    Added comment "WAIT_LOOP".
*              : 20.03.2025 3.01    Changed the disclaimer in program sources.
**********************************************************************************************************************/

/**********************************************************************************************************************
Includes <System Includes> , "Project Includes"
**********************************************************************************************************************/
#include "r_sdc_sd_rx_if.h"
#include ".\src\r_sdc_sd_rx_private.h"

#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM)

/**********************************************************************************************************************
Macro definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Typedef definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Private global variables and functions
**********************************************************************************************************************/
static uint32_t         g_sdc_sdmem_stat_buff[128/sizeof(uint32_t)];
static sdc_sd_status_t  r_sdc_sdmem_init_rca(uint32_t card_no);
static sdc_sd_status_t  r_sdc_sdmem_calc_erase_sector(uint32_t card_no);

/**********************************************************************************************************************
* Outline      : Initialize SD Card
* Function Name: r_sdc_sdmem_initialize
* Description  : Initializes the SD memory card.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : uint32_t           init_type           ;   SDHI Initialize type
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : other                                  ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sdmem_initialize(uint32_t card_no, uint32_t init_type)
{
    sdc_sd_hndl_t   * p_hndl = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    if (SDC_SD_MODE_MEM == init_type)
    {
        /* ==== Initialize card and distinguish card type. ==== */
        if (r_sdc_sdmem_init(card_no) != SDC_SD_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            return p_hndl->error;
        }

        /* ==== Check the card registers. ==== */
        if (r_sdc_sdmem_mount_chk_reg(card_no) != SDC_SD_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            return p_hndl->error;
        }

        if (r_sdc_sdmem_mount(card_no) != SDC_SD_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            return p_hndl->error;
        }
        /* Support the locked card. */
        if (SDC_SD_ERR_CARD_LOCK == p_hndl->error)
        {
            p_hndl->mount = (SDC_SD_CARD_LOCKED | SDC_SD_MOUNT_LOCKED_CARD);
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            return SDC_SD_SUCCESS_LOCKED_CARD;
        }

        /* If it is SD memory card, get the SCR register. */
        if (r_sdc_sdmem_mount_get_scr(card_no) != SDC_SD_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            return p_hndl->error;
        }
    }
    else
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR);
        return SDC_SD_ERR;
    }


    return p_hndl->error;
} /* End of function r_sdc_sdmem_initialize() */

/**********************************************************************************************************************
* Outline      : Mount SD Card
* Function Name: r_sdc_sdmem_mount_chk_reg
* Description  : 
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : other                                  ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sdmem_mount_chk_reg(uint32_t card_no)
{
    sdc_sd_hndl_t   * p_hndl = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

