Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/mem/r_sdc_sdmem_initialize.c
    /* ---- Check the CSD register. ---- */
    if (r_sdc_sd_check_csd(card_no) != SDC_SD_SUCCESS)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        return p_hndl->error;
    }
    /* ---- Do not check the other registers (to be create). ---- */
    /* Get user area size. */
    if (r_sdc_sd_get_size(card_no, SDC_SD_USER_AREA) != SDC_SD_SUCCESS)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        return p_hndl->error;
    }
    /* Check the write protect state. */
    p_hndl->write_protect = (p_hndl->write_protect | (uint8_t)r_sdc_sd_iswp(card_no));

    return p_hndl->error;
} /* End of function r_sdc_sdmem_mount_chk_reg() */

/**********************************************************************************************************************
* Outline      : Mount SD Card
* Function Name: r_sdc_sdmem_mount_get_scr
* Description  : 
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : other                                  ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sdmem_mount_get_scr(uint32_t card_no)
{
    sdc_sd_hndl_t   * p_hndl = 0;
    uint8_t           spec = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    if (r_sdc_sdmem_card_get_scr(card_no) != SDC_SD_SUCCESS)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        return p_hndl->error;
    }
    spec = (uint8_t)((p_hndl->scr[0] & SDC_SD_SCR_SD_SPEC_MASK) >> SDC_SD_BIT_SHIFT_24);
    if (spec)
    {
        p_hndl->sd_spec = spec;
        r_sdc_sdmem_calc_erase_sector(card_no);
    }
    else
    {
        p_hndl->sd_spec = SDC_SD_SPEC_10;
    }

    return p_hndl->error;
} /* End of function r_sdc_sdmem_mount_get_scr() */

/**********************************************************************************************************************
* Outline      : Mount SD Card
* Function Name: r_sdc_sdmem_init
* Description  : 
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : other                                  ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sdmem_init(uint32_t card_no)
{
    sdc_sd_hndl_t   * p_hndl = 0;
    sdc_sd_status_t   ret = SDC_SD_SUCCESS;
    int32_t         i = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    /* Set the default value in order to initialize SD memory. */
    p_hndl->rca[0] = 0;

    /* ==== Set to idle state. (Issue CMD0.) ==== */
    /* WAIT_LOOP */
    for (i = 0 ; i < SDC_SD_MAX_AGAIN_COUNT; i++)
    {
        ret = r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD0, SDC_SD_RESP_NON, 0);
        if ((SDC_SD_SUCCESS == ret) && (i > 0))
        {
            break;
        }
        r_sdc_sd_wait(card_no, 2);  /* Wait for 1ms or more. */
    }

    if (SDC_SD_SUCCESS != ret)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        return SDC_SD_ERR;  /* Error for CMD0 */
    }

    ret = r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD8, SDC_SD_RESP_R7, p_hndl->if_cond[0]);

    if (SDC_SD_SUCCESS == ret)
    {
        /* Check the R7 response. */
        if (SDC_SD_IF_COND_2_7_TO_3_6 != (p_hndl->if_cond[0] & SDC_SD_IF_COND_VOLT_SUP_MASK))
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            p_hndl->error = SDC_SD_ERR_IFCOND_VOLT;
            return SDC_SD_ERR;
        }
        if (SDC_SD_R7_CHK_PATTERN != (p_hndl->if_cond[0] & SDC_SD_R7_CHK_PATTERN_MASK))
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            p_hndl->error = SDC_SD_ERR_IFCOND_ECHO;
            return SDC_SD_ERR;
        }
        /* Set the SD_spec due to SDHC or SDXC. */
        p_hndl->sd_spec = SDC_SD_SPEC_20;
    }
    else
    {
        /* ==== Clear the illegal command error for CMD8. ==== */
        /* WAIT_LOOP */
        for (i = 0 ; i < SDC_SD_MAX_AGAIN_COUNT; i++)
        {
            ret = r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD0, SDC_SD_RESP_NON, 0);
            if (SDC_SD_SUCCESS == ret)
            {
                break;
            }
        }
        /* Set the SD_spec due to SDSC. */
        p_hndl->sd_spec = SDC_SD_SPEC_10;
    }

    /* Get OCR. (Issue ACMD41.) */
    ret = r_sdc_sd_send_ocr(card_no, (int32_t)SDC_SD_MEDIA_SDMEM);

    if (SDC_SD_SUCCESS != ret)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_CARD_TYPE);
        return SDC_SD_ERR;
    }

    p_hndl->media_type = (p_hndl->media_type | SDC_SD_MEDIA_SDMEM);

    /* ---- Get CID. (Issue CMD2.) ---- */
    if (r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD2, SDC_SD_RESP_R2_CID, 0) != SDC_SD_SUCCESS)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        return SDC_SD_ERR;
    }

    return r_sdc_sdmem_init_rca(card_no);

} /* End of function r_sdc_sdmem_init() */

/**********************************************************************************************************************
* Outline      : Initialize Rca
* Function Name: r_sdc_sdmem_init_rca
* Description  : Initializes the SD card, and then gets RCA/CSD and sets SCR.
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
static sdc_sd_status_t r_sdc_sdmem_init_rca(uint32_t card_no)
{
    sdc_sd_hndl_t   * p_hndl = 0;
    int32_t           i = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    /* ---- Get RCA. (Issue CMD3.) ---- */
    if (p_hndl->media_type & SDC_SD_MEDIA_COMBO)  /* SDIO or SD Memory */
    {
        /* WAIT_LOOP */
        for (i = 0; i < SDC_SD_MAX_AGAIN_COUNT; i++)
        {
            if (r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD3, SDC_SD_RESP_R6, 0) != SDC_SD_SUCCESS)
            {
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
                return SDC_SD_ERR;
            }
            if (0x00 != p_hndl->rca[0])
            {
                break;
            }
        }
        /* Illegal RCA */
        if (SDC_SD_MAX_AGAIN_COUNT == i)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            r_sdc_sd_set_err(card_no, SDC_SD_ERR_CARD_CC);
            return SDC_SD_ERR;
        }
    }
    else
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR);
        return p_hndl->error;
    }

    p_hndl->error = SDC_SD_SUCCESS;

    /* ==== Stand-by state  ==== */
    if (SDC_SD_MEDIA_SDIO == p_hndl->media_type)
    {
        return SDC_SD_SUCCESS;
    }

    /* ---- Get CSD. (Issue CMD9.) ---- */
    if (r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD9, SDC_SD_RESP_R2_CSD, p_hndl->rca[0]) != SDC_SD_SUCCESS)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        return SDC_SD_ERR;
    }

    r_sdc_sd_wait(card_no, 3);  /* Wait for 100 clock or more. */

    p_hndl->dsr[0] = 0x0000;

    if (p_hndl->media_type & SDC_SD_MEDIA_MEM)
    {
        /* DSR implemented? */
        if (p_hndl->csd[1] & SDC_SD_CSD_DSR_IMP) /* Implemented */
        {
            /* Set DSR. (Issue CMD4.) */
            p_hndl->dsr[0] = SDC_SD_DSR_DEFAULT;
            if (r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD4, SDC_SD_RESP_NON, p_hndl->dsr[0]) != SDC_SD_SUCCESS)
            {
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
                return SDC_SD_ERR;
            }
        }
    }

