Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/mem/r_sdc_sdmem_initialize.c
    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sdmem_card_get_scr() */

/**********************************************************************************************************************
* Outline      : Read Byte Data from SD Card
* Function Name: r_sdc_sdmem_read_byte
* Description  : Reads byte data from SD card.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : uint32_t           acmd                ;   Command code
*              : uint32_t           arg                 ;   Command argument [31:0]
*              : uint8_t            * p_readbuff        ;   Read data buffer
*              : uint32_t           byte                ;   Number of read bytes
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sdmem_read_byte(uint32_t card_no, uint32_t cmd, uint32_t arg, uint8_t * p_readbuff,
                                       uint32_t byte)
{
    sdc_sd_hndl_t  * p_hndl = 0;
    uint32_t reg_base = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    /* ---- Clear SDBLKCNTEN in order to disable SDHI_SDBLKCNT. ---- */
    R_SDHI_OutReg(p_hndl->channel, SDHI_SDSTOP, SDHI_SDSTOP_INIT);

    /* ---- Set transfer bytes. ---- */
    R_SDHI_OutReg(p_hndl->channel, SDHI_SDSIZE, byte);

    /* ---- Issue a command. ---- */
    if (cmd & SDC_SD_ACMD)  /* ACMD13, ACMD22 and ACMD51 */
    {
        if (r_sdc_sd_send_acmd(card_no, cmd, arg) != SDC_SD_SUCCESS)
        {
            if ((SDC_SD_ERR_END_BIT == p_hndl->error) || (SDC_SD_ERR_CRC == p_hndl->error))
            {
                /* ---- Check the R1 response. ---- */
                if (r_sdc_sd_get_resp(card_no, SDC_SD_RESP_R1) != SDC_SD_SUCCESS)
                {
                    SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
                    r_sdc_sdmem_read_write_error(card_no);
                    return SDC_SD_ERR;
                }
            }
            else
            {
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
                r_sdc_sdmem_read_write_error(card_no);
                return SDC_SD_ERR;
            }
        }
    }
    else    /* CMD30 */
    {
        /* Enable All end, BRE and errors interrupts. */
        if (r_sdc_sd_send_cmd_arg(card_no, cmd, SDC_SD_RESP_R1, arg) != SDC_SD_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            r_sdc_sdmem_read_write_error(card_no);
            return SDC_SD_ERR;
        }
    }

    /* Enable All end, BRE and errors interrupts. */
    r_sdc_sd_disable_icu_int(card_no);
    r_sdc_sd_set_int_mask(card_no, SDHI_SDIMSK1_DATA_TRNS, SDHI_SDIMSK2_BRE);
    r_sdc_sd_enable_icu_int(card_no);

    /* ---- Wait for the BRE interrupt. ---- */
    if (r_sdc_sd_int_mem_wait(card_no, SDC_SD_TIMEOUT_MULTIPLE) != SDC_SD_SUCCESS)
    {
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_HOST_TOE);
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        r_sdc_sdmem_read_write_error(card_no);
        return SDC_SD_ERR;
    }   

    /* ---- Check the errors. ---- */
    if (p_hndl->sdsts2 & SDHI_SDIMSK2_ERR)
    {
        r_sdc_sd_check_sdsts2_err(card_no);
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        r_sdc_sdmem_read_write_error(card_no);
        return SDC_SD_ERR;
    }

    r_sdc_sd_clear_sdsts(card_no, 0, SDHI_SDIMSK2_RE); /* Clear the BRE bit. */

    /* Transfer data. */
    /* Enable All end, BRE and errors interrupts. */
    R_SDHI_GetBuffRegAddress(p_hndl->channel, &reg_base);
    if (r_sdc_sd_read_data(p_readbuff, reg_base, (int32_t)byte) != SDC_SD_SUCCESS)
    {
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_CPU_IF);
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        r_sdc_sdmem_read_write_error(card_no);
        return SDC_SD_ERR;
    }

    /* Wait for All end interrupt. */
    if (r_sdc_sd_int_mem_wait(card_no, SDC_SD_TIMEOUT_RESP) != SDC_SD_SUCCESS)
    {
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_HOST_TOE);
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        r_sdc_sdmem_read_write_error(card_no);
        return SDC_SD_ERR;
    }

    /* ---- Check the errors. ---- */
    if (p_hndl->sdsts2 & SDHI_SDIMSK2_ERR)
    {
        r_sdc_sd_check_sdsts2_err(card_no);
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        r_sdc_sdmem_read_write_error(card_no);
        return SDC_SD_ERR;
    }

    /* Disable all interrupts. */
    r_sdc_sd_disable_icu_int(card_no);
    r_sdc_sd_clear_int_mask(card_no, SDHI_SDIMSK1_DATA_TRNS, SDHI_SDIMSK2_BRE);
    r_sdc_sd_enable_icu_int(card_no);
    /* Clear All end bits. */
    r_sdc_sd_clear_sdsts(card_no, SDHI_SDIMSK1_DATA_TRNS, SDHI_SDIMSK2_ERR);

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sdmem_read_byte() */

/**********************************************************************************************************************
* Outline      : Write Byte Data to SD Card
* Function Name: r_sdc_sdmem_write_byte
* Description  : Writes byte data to SD card
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : uint32_t           cmd                 ;   Command code
*              : uint32_t           arg                 ;   Command argument [31:0]
*              : uint8_t            * p_writebuff       ;   Write data buffer
*              : uint32_t           byte                ;   Number of write bytes
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sdmem_write_byte(uint32_t card_no, uint32_t cmd, uint32_t arg, uint8_t * p_writebuff,
                                        uint32_t byte)
{
    sdc_sd_hndl_t   * p_hndl = 0;
    int32_t           time_out = 0;
    uint32_t reg_base = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    /* ---- Clear SDBLKCNTEN in order to disable SDHI_SDBLKCNT. ---- */
    R_SDHI_OutReg(p_hndl->channel, SDHI_SDSTOP, SDHI_SDSTOP_INIT);

    /* ---- Set transfer bytes. ---- */
    R_SDHI_OutReg(p_hndl->channel, SDHI_SDSIZE, byte);

    /* ---- Issue a command. ---- */
    if (r_sdc_sd_send_cmd_arg(card_no, cmd, SDC_SD_RESP_R1, arg) != SDC_SD_SUCCESS)
    {
        if (SDC_SD_ERR_CARD_LOCK == p_hndl->error)
        {
            p_hndl->error = SDC_SD_SUCCESS;
        }
        else
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            r_sdc_sdmem_read_write_error(card_no);
            return SDC_SD_ERR;
        }
    }

