Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/mem/r_sdc_sdmem_initialize.c
    /* Enable All end, BWE and errors. */
    r_sdc_sd_disable_icu_int(card_no);
    r_sdc_sd_set_int_mask(card_no, SDHI_SDIMSK1_DATA_TRNS, SDHI_SDIMSK2_BWE);
    r_sdc_sd_enable_icu_int(card_no);

    /* ---- Wait for the BWE interrupt. ---- */
    if (r_sdc_sd_int_mem_wait(card_no, SDC_SD_TIMEOUT_MULTIPLE) != SDC_SD_SUCCESS)
    {
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_HOST_TOE);
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        r_sdc_sdmem_read_write_error(card_no);
        return SDC_SD_ERR;
    }

    /* ---- Check the errors. ---- */
    if (p_hndl->sdsts2 & SDHI_SDIMSK2_ERR)
    {
        r_sdc_sd_check_sdsts2_err(card_no);
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        r_sdc_sdmem_read_write_error(card_no);
        return SDC_SD_ERR;
    }

    r_sdc_sd_clear_sdsts(card_no, 0, SDHI_SDIMSK2_WE); /* Clear the BWE bit. */

    /* Transfer data. */
    R_SDHI_GetBuffRegAddress(p_hndl->channel, &reg_base);
    if (r_sdc_sd_write_data(p_writebuff, reg_base, (int32_t)byte) != SDC_SD_SUCCESS)
    {
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_CPU_IF);
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        r_sdc_sdmem_read_write_error(card_no);
        return SDC_SD_ERR;
    }

    /* Wait for All end interrupt. */
    if ((SDC_SD_CMD42 == cmd) && (1 == byte))
    {
        /* Forced erase timeout */
        time_out = SDC_SD_TIMEOUT_ERASE_CMD;
    }
    else
    {
        time_out = SDC_SD_TIMEOUT_RESP;
    }

    if (r_sdc_sd_int_mem_wait(card_no, time_out) != SDC_SD_SUCCESS)
    {
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_HOST_TOE);
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        r_sdc_sdmem_read_write_error(card_no);
        return SDC_SD_ERR;
    }

    if (p_hndl->sdsts2 & SDHI_SDIMSK2_ERR)
    {
        r_sdc_sd_check_sdsts2_err(card_no);
        if (SDC_SD_TIMEOUT_ERASE_CMD == time_out)
        {
            /* Forced erase  */
            if (SDC_SD_ERR_CARD_TOE == p_hndl->error )
            {
                /* Forced erase timeout  */
                r_sdc_sd_clear_sdsts(card_no, SDHI_SDIMSK1_TRNS_RESP, SDHI_SDIMSK2_ERR);
                if (r_sdc_sd_wait_rbusy(card_no, SDC_SD_TIMEOUT_FORCE_CMD) != SDC_SD_SUCCESS)
                {
                    SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
                    r_sdc_sdmem_read_write_error(card_no);
                    return SDC_SD_ERR;
                }
            }
            else
            {
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
                r_sdc_sdmem_read_write_error(card_no);
                return SDC_SD_ERR;
            }
        }
        else
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            r_sdc_sdmem_read_write_error(card_no);
            return SDC_SD_ERR;
        }
    }

    /* Disable all interrupts. */
    r_sdc_sd_disable_icu_int(card_no);
    r_sdc_sd_clear_int_mask(card_no, SDHI_SDIMSK1_DATA_TRNS, SDHI_SDIMSK2_BWE);
    r_sdc_sd_enable_icu_int(card_no);
    /* Clear All end bits. */
    r_sdc_sd_clear_sdsts(card_no, SDHI_SDIMSK1_DATA_TRNS, SDHI_SDIMSK2_ERR);

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sdmem_write_byte() */

/**********************************************************************************************************************
* Outline      : Calculate Erase Sector
* Function Name: r_sdc_sdmem_calc_erase_sector
* Description  : Calculates erase sector
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
static sdc_sd_status_t r_sdc_sdmem_calc_erase_sector(uint32_t card_no)
{
    sdc_sd_hndl_t   * p_hndl = 0;
    uint32_t          au = 0;
    uint32_t          erase_size = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);
    
    if (SDC_SD_SCR_SD_SPEC_2_0 == (p_hndl->scr[0] & SDC_SD_SCR_SD_SPEC_MASK))
    {
        /* AU is not defined. Set to fixed value. */
        p_hndl->erase_sect = SDC_SD_ERASE_SECTOR;
        /* Get AU size. */
        au = ((p_hndl->sdstatus[2] >> SDC_SD_BIT_SHIFT_12) & SDC_SD_STATUS_AU_SIZE);
        if (au > 0)
        {
            /* Get AU_SIZE(sectors). */
            p_hndl->erase_sect = ((8 * 1024) / SDC_SD_SECTOR_SIZE) << au;
            /* Get ERASE_SIZE. */ 
            erase_size = ((p_hndl->sdstatus[2] << SDC_SD_BIT_SHIFT_8) & SDC_SD_STATUS_ERASE_SIZE) |
                          (p_hndl->sdstatus[3] >> SDC_SD_BIT_SHIFT_24);
            if (0 != erase_size)
            {
                p_hndl->erase_sect = (p_hndl->erase_sect * erase_size);
            }
        }
    }
    else
    {
        /* If card is not Ver.2.00, use ERASE_BLK_LEN in CSD. */
    }

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sdmem_calc_erase_sector() */

#endif /* (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM) */

/* End of File */
